#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖``
<details><summary>Validation Output</summary>

```


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.template_file.cb_app: Reading...
data.template_file.cb_app: Read complete after 0s [id=4fe6368bcac8fa1eb254db2ccfa92d55313414b051f17c965a240ba4853f63c7]
tls_private_key.bastion: Refreshing state... [id=161a6b5e631c819356fdc2c450325e1b82ac853c]
aws_iam_role.codebuild_service_role: Refreshing state... [id=codebuild-service-role]
aws_iam_role.ecs_task_role: Refreshing state... [id=ecs-task-role]
aws_key_pair.bastion_key_pair: Refreshing state... [id=bastion-key-test]
aws_ssm_parameter.bastion_key_pair: Refreshing state... [id=/test/bastion/ssh-key]
data.aws_availability_zones.available: Reading...
aws_s3_bucket.tf-bucket: Refreshing state... [id=remote-state-acics]
aws_vpc.main: Refreshing state... [id=vpc-034dd95974f394745]
aws_dynamodb_table.sbx_dynamodb: Refreshing state... [id=remote-state-lock-acics]
aws_iam_role.codedeploy_service_role: Refreshing state... [id=codedeploy-service-role]
aws_s3_bucket.build_artifacts: Refreshing state... [id=my-build-artifacts-bucket-asics]
data.aws_secretsmanager_secret.github_token: Reading...
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=ecs-execution-role]
data.aws_availability_zones.available: Read complete after 1s [id=eu-west-1]
data.aws_iam_policy_document.ecs_auto_scale_role: Reading...
data.aws_iam_policy_document.ecs_auto_scale_role: Read complete after 0s [id=3468681342]
aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:eu-west-1:802288441694:cluster/cb-cluster]
aws_cloudwatch_log_group.cb_log_group: Refreshing state... [id=/ecs/cb-app]
aws_iam_role_policy_attachment.task_s3: Refreshing state... [id=ecs-task-role-20240819081517975400000001]
aws_iam_role.ecs_auto_scale_role: Refreshing state... [id=myEcsAutoScaleRole]
aws_iam_role_policy.codebuild_service_role_policy: Refreshing state... [id=codebuild-service-role:terraform-20240815121418521100000001]
aws_iam_role_policy.codedeploy_service_role_policy: Refreshing state... [id=codedeploy-service-role:terraform-20240815121418543900000002]
aws_iam_role_policy_attachment.ecs-task-execution-role-policy-attachment: Refreshing state... [id=ecs-execution-role-20240819081518024600000002]
aws_ecs_task_definition.app: Refreshing state... [id=cb-app-task]
data.aws_secretsmanager_secret.github_token: Read complete after 0s [id=arn:aws:secretsmanager:eu-west-1:802288441694:secret:GitHubToken-B89asN]
data.aws_secretsmanager_secret_version.github_token_value: Reading...
aws_iam_role_policy_attachment.ecs_auto_scale_role: Refreshing state... [id=myEcsAutoScaleRole-20240816090310994000000001]
data.aws_secretsmanager_secret_version.github_token_value: Read complete after 0s [id=arn:aws:secretsmanager:eu-west-1:802288441694:secret:GitHubToken-B89asN|AWSCURRENT]
aws_codebuild_source_credential.github_credential: Refreshing state... [id=arn:aws:codebuild:eu-west-1:802288441694:token/github]
aws_cloudwatch_log_stream.cb_log_stream: Refreshing state... [id=cb-log-stream]
aws_internet_gateway.gw: Refreshing state... [id=igw-0fb286c9a49c0be0d]
aws_subnet.private[0]: Refreshing state... [id=subnet-036a5e724b44fa8df]
aws_security_group.lb: Refreshing state... [id=sg-05b6da332a709d6c8]
aws_lb_target_group.blue_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:targetgroup/blue-target-group/df48b673d32f1671]
aws_subnet.private[1]: Refreshing state... [id=subnet-0a15b82f75b3300cd]
aws_subnet.public[1]: Refreshing state... [id=subnet-0fe80fa5495cb3632]
aws_subnet.public[0]: Refreshing state... [id=subnet-048eedd36dc7ac201]
aws_route.internet_access: Refreshing state... [id=r-rtb-026c0f34bf1cafc1e1080289494]
aws_codebuild_project.application_build: Refreshing state... [id=arn:aws:codebuild:eu-west-1:802288441694:project/application-build]
aws_security_group.ecs_tasks: Refreshing state... [id=sg-01c3cdcddfa347799]
aws_s3_bucket_public_access_block.sbx_bucket_pa: Refreshing state... [id=remote-state-acics]
aws_s3_bucket_versioning.sbx_bucket_vers: Refreshing state... [id=remote-state-acics]
aws_s3_bucket_server_side_encryption_configuration.sbx_bucket_sse: Refreshing state... [id=remote-state-acics]
aws_lb.main: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:loadbalancer/app/main/ea7fde6e48daa652]
aws_lb_listener.dev_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:listener/app/main/ea7fde6e48daa652/f4d1d61581524194]
aws_ecs_service.main: Refreshing state... [id=arn:aws:ecs:eu-west-1:802288441694:service/cb-cluster/cb-service]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.main will be created
  + resource "aws_ecs_service" "main" {
      + cluster                            = "arn:aws:ecs:eu-west-1:802288441694:cluster/cb-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "cb-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "cb-app"
          + container_port   = 80
          + target_group_arn = "arn:aws:elasticloadbalancing:eu-west-1:802288441694:targetgroup/blue-target-group/df48b673d32f1671"
        }

      + network_configuration {
          + assign_public_ip = true
          + security_groups  = [
              + "sg-01c3cdcddfa347799",
            ]
          + subnets          = [
              + "subnet-036a5e724b44fa8df",
              + "subnet-0a15b82f75b3300cd",
            ]
        }
    }

  # aws_ecs_task_definition.app must be replaced
-/+ resource "aws_ecs_task_definition" "app" {
      ~ arn                      = "arn:aws:ecs:eu-west-1:802288441694:task-definition/cb-app-task:3" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-west-1:802288441694:task-definition/cb-app-task" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - environment      = []
                  - essential        = true
                  - mountPoints      = []
                    name             = "cb-app"
                  ~ portMappings     = [
                      ~ {
                          ~ containerPort = 80 -> 8081
                          ~ hostPort      = 80 -> 8081
                          - protocol      = "tcp"
                        },
                    ]
                  - systemControls   = []
                  - volumesFrom      = []
                    # (4 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "cb-app-task" -> (known after apply)
      ~ revision                 = 3 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # aws_security_group.ecs_tasks will be updated in-place
  ~ resource "aws_security_group" "ecs_tasks" {
        id                     = "sg-01c3cdcddfa347799"
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-05b6da332a709d6c8",
                ]
              - self             = false
              - to_port          = 80
            },
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 8081
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-05b6da332a709d6c8",
                ]
              + self             = false
              + to_port          = 8081
            },
        ]
        name                   = "cb-ecs-tasks-security-group"
        tags                   = {}
        # (7 unchanged attributes hidden)
    }

  # aws_security_group.lb will be updated in-place
  ~ resource "aws_security_group" "lb" {
        id                     = "sg-05b6da332a709d6c8"
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 8081
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8081
            },
        ]
        name                   = "cb-load-balancer-security-group"
        tags                   = {}
        # (7 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @mandicm223, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Workflow`*